#pragma once
#include <cstdint>

// /////////////////////////////////////////////////////////////
// Module: modellib
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk::modellib
{
	// Alignment: 8
	// Size: 0x58
	// 
	// MGetKV3ClassDefaults
	class CPhysSurfacePropertiesSoundNames
	{
	public:
		// MKV3TransferName "impactsoft"
		CUtlString m_impactSoft; // 0x0		
		// MKV3TransferName "impacthard"
		CUtlString m_impactHard; // 0x8		
		// MKV3TransferName "scrapesmooth"
		CUtlString m_scrapeSmooth; // 0x10		
		// MKV3TransferName "scraperough"
		CUtlString m_scrapeRough; // 0x18		
		// MKV3TransferName "bulletimpact"
		CUtlString m_bulletImpact; // 0x20		
		// MKV3TransferName "rolling"
		CUtlString m_rolling; // 0x28		
		// MKV3TransferName "break"
		CUtlString m_break; // 0x30		
		// MKV3TransferName "strain"
		CUtlString m_strain; // 0x38		
		// MKV3TransferName "meleeimpact"
		CUtlString m_meleeImpact; // 0x40		
		// MKV3TransferName "pushoff"
		CUtlString m_pushOff; // 0x48		
		// MKV3TransferName "skidstop"
		CUtlString m_skidStop; // 0x50		
	};
};
