#pragma once
#include <cstdint>

// /////////////////////////////////////////////////////////////
// Module: animationsystem
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk::animationsystem
{
	// Alignment: 1
	// Size: 0x8
	// Has Trivial Destructor
	// 
	// MGetKV3ClassDefaults
	class CSeqAutoLayerFlag
	{
	public:
		bool m_bPost; // 0x0		
		bool m_bSpline; // 0x1		
		bool m_bXFade; // 0x2		
		bool m_bNoBlend; // 0x3		
		bool m_bLocal; // 0x4		
		bool m_bPose; // 0x5		
		bool m_bFetchFrame; // 0x6		
		bool m_bSubtract; // 0x7		
	};
};
