#pragma once
#include "client/C_PointEntity.hpp"
#include "client/C_SceneEntity__QueuedEvents_t.hpp"
#include <cstdint>
namespace source2sdk::client
{
	struct C_BaseFlex;
};

// /////////////////////////////////////////////////////////////
// Module: client
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

namespace source2sdk::client
{
	// Alignment: 8
	// Size: 0x5b8
	// Has VTable
	// 
	// MNetworkVarNames "bool m_bIsPlayingBack"
	// MNetworkVarNames "bool m_bPaused"
	// MNetworkVarNames "bool m_bMultiplayer"
	// MNetworkVarNames "bool m_bAutogenerated"
	// MNetworkVarNames "float32 m_flForceClientTime"
	// MNetworkVarNames "uint16 m_nSceneStringIndex"
	// MNetworkVarNames "CHandle< C_BaseFlex > m_hActorList"
	class C_SceneEntity : public client::C_PointEntity
	{
	private:
		[[maybe_unused]] uint8_t __pad0558[0x8]; // 0x558
	public:
		// MNetworkEnable
		bool m_bIsPlayingBack; // 0x560		
		// MNetworkEnable
		bool m_bPaused; // 0x561		
		// MNetworkEnable
		bool m_bMultiplayer; // 0x562		
		// MNetworkEnable
		bool m_bAutogenerated; // 0x563		
		// MNetworkEnable
		// MNetworkChangeCallback "OnResetClientTime"
		float m_flForceClientTime; // 0x564		
		// MNetworkEnable
		// MNetworkPriority "32"
		uint16_t m_nSceneStringIndex; // 0x568		
		bool m_bClientOnly; // 0x56a		
	private:
		[[maybe_unused]] uint8_t __pad056b[0x1]; // 0x56b
	public:
		CHandle<client::C_BaseFlex> m_hOwner; // 0x56c		
		// MNetworkEnable
		// MNetworkPriority "32"
		C_NetworkUtlVectorBase<CHandle<client::C_BaseFlex>> m_hActorList; // 0x570		
		bool m_bWasPlaying; // 0x588		
	private:
		[[maybe_unused]] uint8_t __pad0589[0xf]; // 0x589
	public:
		CUtlVector<client::C_SceneEntity__QueuedEvents_t> m_QueuedEvents; // 0x598		
		float m_flCurrentTime; // 0x5b0		
	};
};
